In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}

In [3]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna()  # exclui linhas de valores faltantes

     A    B  C
0  1.0  5.0  1

In [7]:
df.dropna(thresh=2) #excluindo apenas linhas que contem 2 valores faltantes

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [8]:
df.fillna(value="Fill")

      A     B  C
0   1.0   5.0  1
1   2.0  Fill  2
2  Fill  Fill  3

In [10]:
df['A'].fillna(value = df['A'].mean()) #renomeando valores faltantes com a media

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [11]:
df.fillna(method='ffill') #preenchendo valores faltantes com seus antigos valroes

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3